syms x1 x2 a b c d

%% 随机向量（X1,X2）的联合密度函数：
f(x1,x2) = 2*( ( (d-c)*(x1-a) +(b-a)*(x2-c) - 2*(x1-a)*(x2-c) ) ) /( (b-a).^2*(d-c).^2 ) ;
% 其中 a <= x1 <=b, c <= x2 <=d  

%% 求X1、X2的边缘密度函数、均值和方差
% 边缘密度函数
f1 = int(f(x1,x2),x2,d,c);   %求X1的边缘密度函数
f2 =int(f(x1,x2),x1,a,b);   %求X1的边缘密度函数

%均值
%方差

%% 协方差和相关系数
cov(x1,x2) = (x1- (a+b)/2)*( x2 - (d+c)/2 )* 2*( ( (d-c)*(x1-a) +(b-a)*(x2-c) - 2*(x1-a)*(x2-c) ) ) /( (b-a).^2*(d-c).^2 ) ;
cov1(x2) = int(cov(x1,x2),x1,a,b);
cov1cov2 = int(cov1(x2),x2,c,d);

%% 判断X1和X2是否独立
if( f(x1,x2) == f1*f2 )
    disp('相互独立');
else
    disp('不相互独立');
end

